---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ChangingWallsweepType
source: html/10aa8a93-35d0-bf9d-d706-50e3c99feaa8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ChangingWallsweepType Property

This wall sweep instance has different profile or material than its type. You may delete the sweep, or if you ignore this warning, it will be regenerated according to its type.

## Syntax (C#)
```csharp
public static FailureDefinitionId ChangingWallsweepType { get; }
```